Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེ་བས་ན་དེ་དག་ལ་འབྲས་བུ་རྣམ་པར་དགོད་པ་ཡང་མི་བྱའོ། །འཕགས་པའི་གང་ཟག་རྣམས་ལ་ནི་ཡོངས་སུ་ཤེས་པ་ཡོད་པས་དེའི་ཕྱིར་དེ་དག་ཉིད་ལ་ལམ་དང་ལམ་མ་ཡིན་པ་དང་།
en: Noble persons do comprehend, therefore just for them there should be a detailed presentation of the path, and what is not the path, and the results.

source: འབྲས་བུ་རྣམ་པར་དགོད་པར་བྱའོ། །གནས་བརྟན་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ཅི་ལགས་ལམ་ལ་བསྒོམས་པས་འབྲས་བུ་འབྱུང་བར་འགྱུར་རམ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཅི་ལམ་བསྒོམས་པའི་རྒྱུས་འབྲས་བུ་འབྱུང་བར་འགྱུར་རམ། འབྲས་བུ་ཐོབ་པར་འགྱུར་རམ་ཞེས་དེ་སྐད་ཞུས་ཏེ།
en: The elder Subhūti asks, “Lord, when they have become habituated to the path” as cause, “does the result appear and do they attain the result?”

source: དེ་ལྟར་གྱུར་ན་དེ་ཡང་དོན་དམ་པ་ཉིད་དུ་འགྱུར་རོ་ཞེས་བྱའོ།
en: If it does, it would happen just as an ultimate.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། རབ་འབྱོར་དེ་ནི་མ་ཡིན་ཏེ།
en: Then the Lord said, “No, Subhūti.

source: ལམ་བསྒོམས་པས་འབྲས་བུ་འབྱུང་བར་མི་འགྱུར། འབྲས་བུ་ཐོབ་པར་མི་འགྱུར་ཏེ་ཞེས་བྱ་བ་ནི།
en: The result does not appear, and they do not attain the result from having become habituated to the path.”

source: ལམ་དང་འབྲས་བུ་གཉིས་ཀ་ཡང་ཀུན་བརྟགས་པ་ཡིན་པས་བསལ་བ་བཀའ་སྩལ་ཏོ།
en: He has refuted both the path and result because they are falsely imagined phenomena. “

source: །རབ་འབྱོར་ལམ་མ་བསྒོམས་པས་ཀྱང་འབྲས་བུ་ཐོབ་པར་མི་འགྱུར་ཏེ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པ་ཡིན་དུ་ཟིན་ཀྱང་ངེས་པ་བསྟན་པའོ།
en: Nor, Subhūti, do they attain the result from having not become habituated to the path.” This is explaining that they are falsely imagined phenomena, but not arbitrary. “

source: །ལམ་གྱིས་འབྲས་བུ་ཐོབ་པར་བྱ་བ་ཡང་མེད་དོ། །ལམ་མ་ཡིན་པས་ཀྱང་ཐོབ་པར་མི་འགྱུར། ལམ་ལ་ཡོད་པའང་མ་ཡིན་ཞེས་བྱ་བ་ནི་ཆོས་ངེས་པར་གྱུར་པ་ཉིད་བསྟན་པའོ།
en: A result to be attained with the path does not exist, it will not be attained with what is not the path, and it does not exist on the path either” teaches the certification of dharmas. “

source: །ཆོས་ཀྱི་དབྱིངས་ལ་ཆར་བཅད་པའི་ཚུལ་གྱིས་འབྲས་བུ་རྣམ་པར་དགོད་པ་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་ཆོས་ཀྱི་དབྱིངས་ལ་དེ་ལྟར་ཆ་ཤས་སུ་བཅད་དེ་རྣམ་པར་དགོད་པ་དོན་དམ་པར་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: In the dharma-constituent they do not make a presentation of the results by way of apportioning them.” This means that in the dharma-constituent, having apportioned them like that, there is ultimately no detailed presentation.

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་དག་ལ་ཆར་བཅད་པ་མ་མཆིས་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་གནས་བརྟན་གྱིས་འདི་སྐད་ཞུས་ཏེ། ཅིའི་ཕྱིར་སྤོང་བ་དང་། ལམ་དང་། འབྲས་བུ་དག་རིས་སུ་བཅད་དེ།
en: With “Lord, if the compounded element and uncompounded element have not been apportioned,” and so on, the elder Subhūti asks why, then, has a detailed presentation been given having specified particular abandonments, paths, and results.

source: རྣམ་པར་དགོད་པར་བྱས་ཞེས་བྱའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། རབ་འབྱོར་ཅི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འམ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་བཀའ་སྩལ་ཏེ།
en: Then the Lord said, “Subhūti, … is the result of stream enterer… compounded or… uncompounded?”

source: དེ་དག་ལ་ནི་དོན་དམ་པར་ཡོངས་སུ་ཤེས་པ་དང་།
en: and so on.

source: རབ་ཏུ་རྟོགས་པའི་རིམ་པ་མེད་པ་ཉིད་དེ།
en: Ultimately they have no stages of comprehension and awakening.

source: འདི་ལྟར་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་སོགས་པ་དེ་དག་ནི་འདུས་མ་བྱས་པ་སྟེ། དེ་དག་ལ་རིམ་པར་དབྱེ་བ་ཉིད་མེད་དོ།
en: Thus the “result of stream enterer,” and so on, are uncompounded and in them there is no division into stages.

source: །དེ་བས་ན་དེ་དག་ཐམས་ཅད་སྟོང་པ་ཉིད་དུ་རབ་ཏུ་རྟོགས་པ་ན་ཆར་བཅད་པ་མེད་དོ།
en: Therefore, given that they are all an awakening to emptiness, none has been apportioned.

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཆོས་རྣམས་ཀྱི་ཆོས་ཀྱི་མཚན་ཉིད་རབ་ཏུ་རྟོགས་པ་ལགས་ཞེས་བྱ་བ་ནི་གལ་ཏེ་དོན་དམ་པར་ཆར་བཅད་པ་དེ་རབ་ཏུ་རྟོགས་པ་མེད་ན་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Explanation of Chapters 74 to 82 “Lord, how have… they realized well what marks dharmas as dharmas” means how have they, if ultimately there is no realization of what has not been apportioned. “

source: །བཅོམ་ལྡན་འདས་སྤྲུལ་པའི་ལམ་སྒོམ་པ་ཇི་ལྟ་བུ་ལགས་ཞེས་བྱ་བ་ནི་སྤྲུལ་པ་དཔེར་བསྟན་པ་ཞུས་པའོ།
en: Lord, how do they meditate on the path of a magical creation?” is asked using the analogy of a magical creation. “

source: །རབ་འབྱོར་ལམ་བསྒོམས་པ་གང་ལ་བརྟེན་ནས་ཞེས་བྱ་བ་ལ་སོགས་པས་སྤྲུལ་པའི་དཔེ་ཉིད་སྒྲུབ་པོ།
en: Subhūti, it is based on meditating on a path,” and so on, says the achievement is just analogous to a magical creation. “

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པར་རབ་ཏུ་རྟོགས་པར་འགྱུར་ཞེས་བྱ་བ་ནི་མེད་པ་ལ་ཇི་ལྟར་རབ་ཏུ་རྟོགས་ཏེ།
en: Lord, how do bodhisattva great beings realize all dharmas that are nonexistent things” means how, if they are nonexistent, is there a realization?

source: རི་བོང་གི་རྭ་ལ་སོགས་པ་རབ་ཏུ་རྟོགས་པར་མི་འགྲུབ་པོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: There is no achievement of the realization of a rabbit’s horns and so on. “

source: །དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་དངོས་པོ་འགའ་ཞིག་ལ་བརྟེན་ཏེ། ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བའམ།
en: Is there any existent thing apprehended in a tathāgata’s magical creation, thanks to which it is defiled and is purified?”

source: རྣམ་པར་བྱང་བར་འགྱུར་བའི་དངོས་པོ་གང་ཡང་དམིགས་སུ་ཡོད་དམ་ཞེས་བྱ་བ་འདིས་དེ་བཞིན་གཤེགས་པ་ལ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་ཅིང་རྣམ་པར་བྱང་བ་མེད་པས་འགྲོ་བ་དང་ཐར་པ་མཚུངས་པའི་ཕྱིར་རབ་ཏུ་རྟོགས་པ་ཡང་མེད་དེ།
en: This teaches that for the tathāgatas there is no defilement and there is no purification.

source: མེད་པ་ཉིད་དུ་གཞག་པ་ཙམ་དུ་ཟད་པའི་ཕྱིར་ཅི་ཡང་མ་ཡིན་ནོ་ཞེས་བསྟན་ཏོ།
en: There is no realization because the forms of suffering life and liberation are similar; it is nothing at all because it is simply posited as just nonexistent. “

source: །བཅོམ་ལྡན་འདས་གང་གིས་སེམས་ཅན་རྣམས་འཁོར་བ་ལས་ཐར་བར་བགྱི་བའི་འགྲོ་བ་ལྔའི་འཁོར་བ་ཡང་མ་མཆིས་ལགས་ན་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེས་བུའི་མཐར་འགྱུར་ཞེས་བྱ་བ་ནི་འཁོར་བ་རང་བཞིན་གྱིས་ཡང་དག་པར་ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་ངོ་བོ་ཉིད་ཀྱིས་གྲོལ་བའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས།
en: Lord, … if the five forms of life in saṃsāra from which beings will be liberated do not exist, how is there going to be a bodhisattva’s personal heroic power?” This means that in its basic nature saṃsāra is unreal, so in its intrinsic nature it is liberated.

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་བཀའ་སྩལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་ནམ་འཁོར་བ་མི་མཐོང་ངོ་།
en: Then the Lord said, “What do you think, Subhūti,” and so on. Bodhisattvas do not see beings or a cycle of existences.

source: །རྨི་ལམ་ལ་སོགས་པའི་དཔེ་དེ་དག་གིས་སྔོན་མཐོང་མོད་ཀྱི། འོན་ཀྱང་དེ་དག་མེད་པར་སེམས་ཅན་རྣམས་ཀྱིས་མི་ཤེས་ཏེ། དེ་བས་ན་དེ་དག་ཤེས་པར་བྱེད་པ་ནི་དེའི་སྐྱེས་བུའི་མཐུ་ཡིན་ནོ་ཞེས་བསྟན་ཏེ།
en: Those analogies of a dream and so on teach that they did see earlier, but beings do not know they are nonexistent, so their “personal heroic power” is causing them to understand. “

source: དེ་ཉིད་རབ་འབྱོར་གལ་ཏེ། སེམས་ཅན་རྣམས་རང་རང་གིས་ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུ་ནས། སྤྲུལ་པ་ལྟ་བུའི་བར་དུ་ཤེས་སུ་ཟིན་ན་ནི་ཞེས་བྱ་བ་ལ་སོགས་པས་སྟོན་ཏོ།
en: Subhūti, if, just on their own, beings knew that all dharmas are like a dream, up to are like a magical creation,” and so on, teaches just that. “

source: །ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ནི་མིང་སྟེ་གཞོལ་བའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་ཆོས་ཐམས་ཅད་ཀུན་བརྟགས་པའི་རང་བཞིན་ལ་མིང་ཞེས་བྱ་སྟེ།
en: The basic nature of all dharmas is name because they point somewhere.” All falsely imagined dharmas with a falsely imagined basic nature are called “name.”

source: འདི་ལྟར་སེམས་ཅན་རྣམས་ཀྱི་བློ་དེ་ལ། དེ་བཞིན་དུ་གཞོལ་བའམ། བློ་ལ་རང་བཞིན་དེ་གཞོལ་བའོ།
en: Therefore, they point like that to that intellectually active mind of beings, or that basic nature points to that intellectually active mind.

source: །མཚན་མ་མེད་པ་ཡང་གཞན་ལ། ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་ཀྱང་གཞན་ནམ་ཞེས་བྱ་བ་ལ་སོགས་པས་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ།
en: With “is signlessness one thing and śrāvaka dharmas another?”

source: གལ་ཏེ་ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་ཡིན་ལ། ཉན་ཐོས་ཀྱི་ཆོས་ལ་སོགས་པ་མཚན་མ་དང་བཅས་པར་རྣམ་པར་བཀོད་པར་གྱུར་ན། དེ་ལྟ་ན་ནི་སྐྱོན་དུ་ཡང་འགྱུར་ན། འདི་ལྟར་དེ་དག་ཐམས་ཅད་ནི་མཚན་མ་མེད་པ་སྟེ། དེའི་ཕྱིར་ཉེས་པ་མེད་དོ་ཞེས་སྟོན་ཏོ།
en: and so on, the Lord explains that if, given that all dharmas are signless, he had presented śrāvaka dharmas and so on as having signs, then there would be a fault, but because they are all signless there is therefore no fault. “

source: །དེས་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་དཀྲུགས་པར་མི་འགྱུར་ལགས་སམ་ཞེས་བྱ་བ་ནི་མཚན་ཉིད་མེད་པ་རྣམས་ལ།
en: Does that not complicate the dharma-constituent?”

source: མཚན་ཉིད་དུ་རྟོགས་ན། དེ་བཞིན་ཉིད་ཀྱི་བདག་ཉིད་ཅན་ལ་སོ་སོར་ཐ་དད་དུ་འཛིན་པའི་ཕྱིར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means it would complicate it, because, when they realize defining marks in dharmas that have no defining marks, they would grasp each differently even though they are in fact suchness. “

source: །རབ་འབྱོར་གལ་ཏེ། ཆོས་ཀྱི་དབྱིངས་སུ་མ་གཏོགས་པའི་ཆོས་འགའ་ཞིག་ཡོད་ན་ནི་རྣམ་པར་དཀྲུགས་པར་ཡང་འགྱུར་ན་ཞེས་བྱ་བ་ལ་སོགས་པས།
en: Subhūti, the dharma-constituent would be complicated if there were to be any other dharma not included in the dharma-constituent,” and so on.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ། དེ་ལྟར་རྟོག་ཏུ་ཟིན་ཀྱང་ཕྱིས་ཤེས་རབ་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་དུ་ཆོས་ཐམས་ཅད་ཐ་དད་པ་མེད་པར་རབ་ཏུ་རྟོག་སྟེ།
en: With this the Lord teaches that even though they conceive of dharmas like that, still, later they realize with wisdom that all are not different because of having the dharma-constituent as their intrinsic nature.

source: དེ་བས་ན་རྣམ་པར་དཀྲུགས་པར་མི་འགྱུར་རོ་ཞེས་བསྟན་ཏོ།
en: Therefore, they do not complicate the dharma-constituent. “

source: །རབ་འབྱོར་གཟུགས་ཀྱི་ཁམས་ནི་ཆོས་ཀྱི་དབྱིངས་སོ་ཞེས་བྱ་བ་ནི་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: Subhūti, the form constituent is the dharma-constituent” is the suchness of form. “Do they train in form?”

source: །ཅི་གཟུགས་ལ་བསླབ་པར་བགྱི་འམ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་ཙམ་དུ་ཟད་ནས། གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ཤིན་ཏུ་མེད་པས། དེ་ལ་སློབ་ན་ཕྱིན་ཅི་ལོག་དང་མཚུངས་པར་འགྱུར་རོ་ཞེས་ཞུས་པའོ།
en: Subhūti is asking: since all dharmas are exhausted in the dharma-constituent, the dharmas, form and so on, would be absolutely nonexistent, so, when they train in them would it not be similar to an error? “

source: །ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་དབྱིངས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་ཉིད་དུ་རབ་ཏུ་ཤེས་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་དུ། གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ཙམ་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་གི་གཞན་དུ་ནི་མ་ཡིན་ནོ།
en: Are aware of all dharmas as they really are, the dharma-constituent,” and so on, says: They see the dharmas, form and so on, as just the dharma-constituent, not as something else.

source: །སེམས་ཅན་རྣམས་ལ་རྣམ་པ་གཞན་དུ་འཛིན་དུ་གཞུག་མི་ནུས་པའི་ཕྱིར་གཟུགས་ལ་སོགས་པ་ལ་མཚན་མ་མེད་པར་བཏགས་ཏེ། ཐབས་མཁས་པས་ཆོས་ཀྱི་དབྱིངས་ཉིད་བསྟན་ཏོ།
en: They cannot inspire beings to take it up in some other way, so they teach the dharma-constituent with skillful means, having designated form and so on as signlessness. “

source: །རབ་འབྱོར་གལ་ཏེ་ཆོས་ཀྱི་དབྱིངས་སྔོན་ཇི་ལྟ་བར་ཕྱིས་ཀྱང་དེ་བཞིན་མ་ཡིན་ལ། བར་དུ་ཡང་དེ་བཞིན་མ་ཡིན་དུ་ཟིན་ན་ནི་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་ཅེས་བསྟན་ཏེ། འདི་ལ་ཆོས་ཀྱི་དབྱིངས་སྔོན་གྱི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་དུས་ན་ནི་མ་དག་པ་ཡིན། བར་དུ་བྱང་ཆུབ་སེམས་དཔའི་དུས་ན་ནི་དག་པ་དང་མ་དག་པ་ཡིན། ཕྱིས་ཐ་མར་ནི་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཡིན་ཏེ།
en: Subhūti, if the dharma-constituent were not exactly the same later as it was before, and if it were not like that in between as well,” and so on, is teaching: “before,” at the time of a foolish, ordinary person, the dharma-constituent was impure; “in between,” at the time of a bodhisattva, it is pure and impure; and “later,” at the end, it is absolutely pure.

source: དེ་ལ་དེ་ཙམ་དུ་ཟད་ཀྱི། དེས་དེ་ལ་བྱེ་བྲག་ཡོད་པར་ཤེས་པར་མི་བྱ་སྟེ།
en: So far so good, but you should not understand from this that there are specific features there.

source: ངོ་བོ་ཉིད་ཀྱིས་དུས་ཐམས་ཅད་དུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ངོ་བོ་ཉིད་དུ་རྣམ་པར་དག་པ་ཉིད་དོ་ཞེས་བསྟན་པའོ།
en: In its intrinsic nature it is pure at all times, pure in its absolutely pure nature. “

source: །རབ་འབྱོར་ཡང་དག་པའི་མཐའ་ཚད་མར་བྱས་ནས་ཞེས་བྱ་བས་ནི་འདི་སྐད་དུ། བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མི་སྤྱོད་ཀྱི། ཡང་དག་པའི་མཐའི་དོན་དུ་སྤྱོད་དོ།
en: Subhūti, having taken the very limit of reality as the measure” is saying: Bodhisattvas do not practice the perfection of wisdom for the sake of beings, they practice for the sake of the very limit of reality.

source: །འདི་ལྟར་ཡོད་པ་མ་ཡིན་པས་མེད་པའི་སེམས་ཅན་ཡོངས་སུ་བཏང་ནས། ཡང་དག་པའི་མཐའི་ངོ་བོ་ཉིད་ལ་རབ་ཏུ་དགོད་དེ།
en: Thus, having set aside nonexistent beings because they are not existent, they establish them in the very limit of reality that is their intrinsic nature.

source: སེམས་ཅན་གྱི་མཐའ་ཉིད་ཡང་དག་པའི་མཐར་བྱེད་དོ་ཞེས་སྟོན་ཏོ།
en: The very limit of beings is made into the very limit of reality. “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཡང་དག་པའི་མཐའ་ཉིད་སེམས་ཅན་གྱི་མཐའ་ལགས་ན་ཞེས་བྱ་བ་འདིས་ནི་འདི་སྐད་དུ། གལ་ཏེ་ཡང་དག་པའི་མཐའ་མ་གཏོགས་པར་སེམས་ཅན་གྱི་མཐའ་ཞེས་བྱ་བ་མེད་ན། འོ་ན་སེམས་ཅན་རྣམས་དང་། ཡང་དག་པའི་མཐའ་གཅིག་པའི་ཕྱིར། གང་འདི་སྐད་དུ་སེམས་ཅན་རྣམས་ཡང་དག་པའི་མཐའ་ལ་དགོད་དོ་ཞེས་བྱ་བ་དེ་ནི་མི་རིགས་ཏེ།
en: Lord, if just the very limit of reality is also the limit of beings” is asking: if a “limit of beings” were not to exist as anything other than the very limit of reality, well then, beings and the very limit of reality would be the same, so what you have said, that they “establish beings at the very limit of reality” would not be right.

source: དེ་ཉིད་དེ་ལ་འགོད་ན་ནི་ཡང་དག་པའི་མཐའ་ལ་ཡང་དག་པའི་མཐའ་རབ་ཏུ་འཇོག་གོ་ཞེས་བྱ་བར་འགྱུར་ཏེ། དེ་ཡང་མི་རིགས་སོ་ཞེས་ཞུས་པ་དང་།
en: If they were to establish just that in that, they would be saying “the very limit of reality enters into the very limit of reality,” and that is not right either.

source: ཐབས་མཁས་པས་སེམས་ཅན་གྱི་མཐའ་ཡང་དག་པའི་མཐའ་ལ་འགོད་དེ། ཡང་དག་པའི་མཐའ་རྣམ་པར་འཁྲུག་པར་ཡང་མི་བྱེད་དོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་ཏེ།
en: The Lord says, “With skillful means they establish the limit of beings at the very limit of reality without complicating the very limit of reality.”

source: ངོ་བོ་ཉིད་ནི་ངོ་བོ་ཉིད་ལ་རབ་ཏུ་མི་འཇོག་གི་ཀུན་བརྟགས་པའི་སེམས་ཅན་གྱི་མཐའ་དང་།
en: An intrinsic nature does not enter into an intrinsic nature.

source: ཀུན་བརྟགས་པའི་སེམས་ཅན་གྱི་དངོས་པོ་བསྩལ་ནས། ཤིན་ཏུ་ཡོངས་སུ་དག་པ་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ལ་ཐབས་མཁས་པས་འགོད་པ་ལ།
en: Having eliminated a falsely imagined limit of beings and a falsely imagined real basis of beings with skillful means, they establish them in their intrinsic nature, which is absolutely pure suchness, “establishing them at the very limit of reality.”

source: ཡང་དག་པའི་མཐའ་ལ་རབ་ཏུ་འགོད་པ་ཞེས་བྱ་སྟེ། དེ་བས་ན་སེམས་ཅན་གྱི་མཐའ་དང་། ཡང་དག་པའི་མཐའ་ནི་ཐ་མི་དད་ཅིང་གཅིག་སྟེ། གཉིས་སུ་མེད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Therefore, this means that the very limit of reality and the limit of beings are an undivided unity, “are not two.”

source: །དེའི་འོག་ཏུ་དེ་ལྟ་བུའི་ཐབས་མཁས་པ་གང་ལགས་ཞེས་ཞུས་པ་དང་།
en: Then he asks, “What are the skillful means?”

source: ཆོས་ཐམས་ཅད་ཡང་དག་པའི་མཐའ་ཡིན་པར་ཡོངས་སུ་བསྔོས་ནས། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ནི་ཐབས་མཁས་པ་ཡིན་པར། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ་ཞེས་བྱ་བ་ལ་སོགས་པས་སྟོན་ཏོ།
en: And “Subhūti, here, starting from the first production of the thought, bodhisattva great beings,” and so on, teaches that having transformed all dharmas into the very limit of reality, the completion of the six perfections is skillful means.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གདམས་པ་དེ་ཡང་གོ་སླའོ།
en: The instruction in the perfections is easy to understand. “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་ལགས་ན། རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ལ་ནི་སེམས་ཅན་ཡང་མི་དམིགས་ཆོས་དང་ལམ་ཡང་མི་དམིགས་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་དུ། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་ཡིན་ན་སེམས་ཅན་དང་། ཆོས་དང་། ལམ་རྣམས་མེད་པར་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་བྱས་ནས་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་བསྒོམས་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གནས་པར་བྱེད་ཅེས་ཞུས་པའོ།
en: Lord, if all phenomena are empty of a basic nature, and if in the emptiness of a basic nature a being is not apprehended, nor are a dharma and a path apprehended,” and so on, asks the following: if all phenomena are empty of an intrinsic nature and “a being… a dharma, and a path” do not exist, “how will bodhisattva great beings,” having brought beings to maturity, having purified a buddhafield, and having cultivated the knowledge of path aspects, “stand in the knowledge of all aspects?”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། རབ་འབྱོར་གལ་ཏེ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་མ་ཡིན་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་དུ། གལ་ཏེ་ཆོས་སམ། ལམ་དག་སོ་སོ་ན་ཡོད་ན་ནི་འགའ་ཞིག་དམིགས་པར་འགྱུར་བའི་རིགས་ཏེ། དེ་ལྟ་ན་ནི་དེ་བཞིན་དུ་སེམས་ཅན་དང་། སྲོག་ལ་སོགས་པ་ཐམས་ཅད་ཀྱང་ཡོད་པར་འགྱུར་ཏེ། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་ལ་གནས་པས་སངས་རྒྱས་སུ་ཡང་མི་འགྱུར་ལ། གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དུ་བཤད་པར་ཡང་མི་འགྱུར་བ་ཞིག་ན།
en: Then the Lord, with “Subhūti, were all phenomena not empty of a basic nature,” and so on, teaches that if dharmas or paths were to exist separately, it would be right to apprehend something, and in that case there would be all living beings and so on, and bodhisattvas would not, therefore, having stood in emptiness, become buddhas, and would not explain all dharmas, form and so on, as emptiness.

source: འདི་ལྟར་རང་བཞིན་སྟོང་པ་ཉིད་ལ་ནི་ཆོས་སམ། ལམ་དག་མེད་དེ།
en: But there are no such dharmas or paths in the emptiness of a basic nature.

source: དེའི་ཕྱིར་སྟོང་པ་ཉིད་དེ་གྲུབ་པར་འགྱུར་ཏེ།
en: Therefore, that emptiness is established.

source: དེ་བས་ན་སྟོང་པ་ཉིད་དེ་ལ་གནས་ནས་སངས་རྒྱས་སུ་ཡང་འགྱུར་ལ། སྟོང་པ་ཉིད་ཆོས་བཤད་པར་ཡང་འགྱུར་ཏེ།
en: Having stood in emptiness they therefore become buddhas and explain all the emptiness dharmas.

source: དེ་བས་ན་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་དབང་གིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་འཇུག་པ་གྲུབ་པོ་ཞེས་སྟོན་ཏོ།
en: Hence it is established that they enter into the knowledge of all aspects thanks to the emptiness of a basic nature.

source: །དེ་སྐད་བཀའ་སྩལ་ནས་ཡང་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ཉི་ཚེ་སྟོང་པར་མ་ཟད་ཀྱི། ནང་སྟོང་པ་ཉིད་ལ་སོགས་པ་སྟོང་པ་ཉིད་བཅུ་དྲུག་པོ་དག་ཀྱང་རང་བཞིན་སྟོང་པ་ཉིད་ཡིན་པར། རབ་འབྱོར་གལ་ཏེ་ནང་སྟོང་པ་ཉིད་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་མ་ཡིན་ན་ནི་ཞེས་བྱ་བ་ལ་སོགས་པས་སྟོན་ཏེ།
en: He continues with “Subhūti, if inner emptiness were not empty of a basic nature,” and so on, teaching that not only the trivial dharmas, form and so on, are empty, but that the sixteen emptinesses, inner emptiness and so on, are empty of a basic nature too.

source: གལ་ཏེ་ནང་སྟོང་པ་ཉིད་ལ་སོགས་པ་ཡང་། རང་བཞིན་གྱིས་སྟོང་པ་མ་ཡིན་དུ་ཟིན་ན། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དུ་བཤད་པ་མི་འགྲུབ་པོ།
en: Were inner emptiness and so on not empty of a basic nature, the explanation of all dharmas as emptiness would not be well founded.

source: །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་བཤིག་པར་འགྱུར་ན་ཞེས་བྱ་བ་ནི་ནང་སྟོང་པ་ཉིད་ལ་སོགས་པ་རང་བཞིན་གྱིས་སྟོང་པ་མ་ཡིན་དུ་ཟིན་ན་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ལས་ཀྱང་ཉམས་པར་འགྱུར་ཏེ།
en: Emptiness of a basic nature “The emptiness of a basic nature would have been destroyed.” If inner emptiness and so on were not also empty of a basic nature, the teaching “that ‘all dharmas are empty of a basic nature’ ” would get damaged, in the sense of being destroyed.

source: ཞིག་པར་འགྱུར་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །དེའི་འོག་ཏུ་སྟོང་པ་ཉིད་ཆོས་གནས་པའི་མཚན་ཉིད་ཡིན་པར་རང་བཞིན་སྟོང་པ་ཉིད་ནི་འཇིག་པར་མི་འགྱུར་ཐེར་ཟུག་ཏུ་གནས་པ་ཡང་མ་ཡིན་ཏེ།
en: Then “the emptiness of a basic nature does not perish, is not immovable, and is not nonrecurring” teaches the emptiness that is the mark of the establishment of dharmas.

source: ཕྱིས་མེད་པར་འགྱུར་བ་ཡང་མ་ཡིན་ནོ་ཞེས་བྱ་བས་སྟོན་ཏོ། །ཆོས་གནས་པའི་མཚན་ཉིད་འདི་ཡང་རྣམ་པ་བཞིས་བསྟན་ཏེ། རྣམ་པར་འཇིག་པ་ལ་སོགས་པ་མེད་པ་དང་འཕེལ་བ་དང་འགྲིབ་པ་ལ་སོགས་པ་མེད་པ་དང་། གནས་དང་ཡང་དག་པར་འཇུག་པ་མེད་པ་དང་། སྒྲིབ་པ་མེད་པའོ།
en: This mark of the establishment of dharmas, furthermore, is taught fourfold: not perishing and so on; not increasing or decreasing and so on; not being established and not being established after having set out; and not obstructing.

source: །དེ་ལ་འགྲེས་དང་པོ་ནི་འདུས་མ་བྱས་པའི་ཕྱིར་རྣམ་པར་འཇིག་པར་མི་འགྱུར་བའོ། །དངོས་པོ་མེད་པའི་བདག་ཉིད་ཡིན་པས་ཐེར་ཟུག་ཏུ་གནས་པ་མ་ཡིན་པའོ། །འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བའི་ཕྱིར་མེད་པར་མི་འགྱུར་བའོ།
en: There, the first of those subsections is: it “does not perish” because it is uncompounded; it “is not immovable” because it is constituted as a nonexistent thing; and it “is not nonrecurring” because it is freedom from forms of life.

source: །དེ་ནས་ཡང་གསུམ་པོ་དེ་དག་ཉིད་ཞིབ་ཏུ་སྟོན་ཏོ། །ཡུལ་ན་ནི་གནས་ཞེས་བྱ་བས་ནི་འདུས་མ་བྱས་ཉིད་དུ་བསྟན་ཏོ། །འདུས་བྱས་ནི་ཡུལ་ན་གནས་པའི་ཕྱིར་རོ། །ཕྱོགས་ན་མི་གནས་པ་ནི་དངོས་པོ་མེད་པས་ཁྱབ་པའི་ཕྱིར་རོ། །གང་ནས་ཀྱང་འོང་བ་མ་ཡིན། གང་དུ་ཡང་འགྲོ་བ་མ་ཡིན་པ་ནི་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བའི་ཕྱིར་རོ།
en: Then it again teaches these same three in detail with “it does occupy a location,” teaching that it is in an uncompounded state because something compounded occupies a location; it “does not stand in a place,” because it is pervaded by a nonexistent thing; and it “does not come from anywhere and does not go anywhere,” because it is freedom from forms of life.

source: །འཕེལ་བ་ལ་སོགས་པ་མེད་པའི་འགྲེས་ནི་སྔ་མ་བཞིན་ནོ།
en: The second subsection on not increasing and so on is as before. “

source: །ཆོས་ཐམས་ཅད་གནས་པ་མེད་པ་ཞེས་བྱ་བ་ནི་མི་གནས་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་རོ། །འཇུག་པ་མེད་པ་ནི་ངེས་པར་འབྱུང་བ་མེད་པའི་ཕྱིར་རོ།
en: All dharmas are not established” because they are in their intrinsic nature not established, “and not established after having set out” because an escape does not exist.

source: །དེ་དག་གིས་ནི་ཆོས་འདི་དག་ལས་གང་ལ་གནས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་འཇུག་ཅེས་གང་སྨྲས་པ་དེ་ལ་གནས་ཏེ་ཞེས་བྱ་བ་དང་། འཇུག་པ་ཞེས་བྱ་བ་འདིས་གཉིས་ཉེ་བར་བརྟགས་པ་སྟོན་ཏོ།
en: These two teach the investigation of the two—the “established” and the “established after having set out”—in the statement about dharmas other than these two, “established in which bodhisattvas are, after setting out, established in unsurpassed, perfect, complete awakening.” “

source: །དེས་ཆོས་གང་ལ་སྒྲིབ་པ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ་ཞེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་ལ་ཆགས་པའོ།
en: They do not see any dharma at all as obstructing” as an attachment to emptiness. “

source: །དེས་ཆོས་ཐམས་ཅད་སྒྲིབ་པ་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་སྟོང་པར་མཐོང་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: They see all dharmas as not obstructing” means they see all dharmas are empty.

source: །དེའི་འོག་ཏུ་གང་ལ་བདག་མི་དམིགས་པ་ཞེས་བྱ་བ་ལ་སོགས་པས་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་སྟོན་ཏེ།
en: Then, they “do not apprehend… a self,” and so on, teaches “the emptiness of a basic nature.” “

source: དེ་ལ་འདི་ནི་རང་བཞིན་སྟོང་པ་ཉིད་དོ།
en: In that”— in this emptiness of a basic nature.

source: །རང་བཞིན་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ནི་གང་ཟག་ལ་བདག་མེད་པ་དང་། ཆོས་ལ་བདག་མེད་པ་ཡང་བསྟན་ཏེ།
en: The “emptiness of a basic nature” teaches that persons have no self, and dharmas have no self.

source: བདག་མེད་པ་དེ་གཉིས་ཀྱང་དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པའི་དགེ་སློང་དང་། དགེ་སློང་མའི་དཔེས་བསྒྲུབ་པའོ།
en: The illustration of “a tathāgata’s… magically created monk or nun” establishes those two selflessnesses. “

source: །ཕྱིན་ཅི་ལོག་གང་ཡིན་པ་དེ་ཉིད་ཕྱིན་ཅི་ལོག་མ་ཡིན་པ་ཞེས་བྱ་བ་ནི་གནས་དེ་ཉིད་སྔོན་ཀུན་བརྟགས་པའི་གནས་སྐབས་ན་ནི་ཕྱིན་ཅི་ལོག་ཅེས་བྱའོ།
en: Just that error is itself not error.”

source: །ཡོངས་སུ་དག་པའི་གནས་སྐབས་ན་ནི་ཕྱིན་ཅི་མ་ལོག་པའོ།
en: Earlier, in the context of the falsely imagined, “just that” foundation “is itself error”; in the context of the thoroughly purified it is “not error.” “

source: །རྟོག་པའི་རྒྱུ་མཐུན་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཀུན་རྟོག་པའི་འབྲས་བུ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Because of having thought construction as cause”— it has in mind a falsely imagined result. “

source: །དེ་ཡང་དེ་ལ་དོན་དམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ནི་མ་ཡིན་ཞེས་བྱ་བ་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་ལ་སོགས་པ་ཡང་ཀུན་བརྟགས་པ་ཡིན་གྱི། དོན་དམ་པ་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་སྟེ།
en: They, furthermore, are not exactly like the ultimate there” means “the applications of mindfulness,” and so on, are falsely imagined, they are not the ultimate.
